PX4/PX4-Autopilot/platforms/nuttx/src/px4/nxp/s32k1xx/hrt/hrt.c
/****************************************************************************
 *
 *   Copyright (c) 2016-2020 PX4 Development Team. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name PX4 nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

/**
 * @file drv_hrt.c
 * Author: Peter van der Perk <peter.vanderperk@nxp.com>
 *         David Sidrane <david_s5@nscdg.com>
 *
 * High-resolution timer callouts and timekeeping.
 *
 * This can use any S32K FTM timer.
 *
 * Note that really, this could use systick too, but that's
 * monopolised by NuttX and stealing it would just be awkward.
 *
 * We don't use the NuttX S32K driver per se; rather, we
 * claim the timer and then drive it directly.
 */

#include <px4_platform_common/px4_config.h>
#include <systemlib/px4_macros.h>
#include <lib/perf/perf_counter.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>

#include <sys/types.h>
#include <stdbool.h>

#include <assert.h>
#include <debug.h>
#include <time.h>
#include <queue.h>
#include <errno.h>
#include <string.h>

#include <board_config.h>
#include <drivers/drv_hrt.h>

#include "hardware/s32k1xx_ftm.h"

#undef PPM_DEBUG

#ifdef CONFIG_DEBUG_HRT
#  define hrtinfo _info
#else
#  define hrtinfo(x...)
#endif

#define CAT3_(A, B, C)    A##B##C
#define CAT3(A, B, C)     CAT3_(A, B, C)

#ifdef HRT_TIMER

#define HRT_TIMER_FREQ         1000000

/* HRT configuration */

#define HRT_TIMER_CLOCK        BOARD_FTM_FREQ                                /* The input clock frequency to the FTM block */
#define HRT_TIMER_BASE         CAT(CAT(S32K1XX_FTM, HRT_TIMER), _BASE)       /* The Base address of the FTM */

/* The FTM Interrupt vector */

#if defined(CONFIG_ARCH_CHIP_S32K14X)
#  if (HRT_TIMER_CHANNEL == 0) || (HRT_TIMER_CHANNEL == 1)
#    define HRT_TIMER_VECTOR   CAT(CAT(S32K1XX_IRQ_FTM, HRT_TIMER), _CH0_1)
#  elif (HRT_TIMER_CHANNEL == 2) || (HRT_TIMER_CHANNEL == 3)
#    define HRT_TIMER_VECTOR   CAT(CAT(S32K1XX_IRQ_FTM, HRT_TIMER), _CH2_3)
#  elif (HRT_TIMER_CHANNEL == 4) || (HRT_TIMER_CHANNEL == 5)
#    define HRT_TIMER_VECTOR   CAT(CAT(S32K1XX_IRQ_FTM, HRT_TIMER), _CH4_5)
#  elif (HRT_TIMER_CHANNEL == 6) || (HRT_TIMER_CHANNEL == 7)
#    define HRT_TIMER_VECTOR   CAT(CAT(S32K1XX_IRQ_FTM, HRT_TIMER), _CH6_7)
#  endif
#elif defined(CONFIG_ARCH_CHIP_S32K11X)
#  define HRT_TIMER_VECTOR     CAT(CAT(S32K1XX_IRQ_FTM, HRT_TIMER), _CH0_7)
#endif

#define LOG_1(n) (((n) >= 2) ? 1 : 0)
#define LOG_2(n) (((n) >= 1<<2) ? (2 + LOG_1((n)>>2)) : LOG_1(n))

#if HRT_TIMER == 0 && defined(CONFIG_S32K1XX_FTM0)
#  error must not set CONFIG_S32K1XX_FTM0=y and HRT_TIMER=0
#elif HRT_TIMER == 1 && defined(CONFIG_S32K1XX_FTM1)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=1
#elif HRT_TIMER == 2 && defined(CONFIG_S32K1XX_FTM2)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=2
#elif HRT_TIMER == 3 && defined(CONFIG_S32K1XX_FTM3)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=3
#elif HRT_TIMER == 4 && defined(CONFIG_S32K1XX_FTM4)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=4
#elif HRT_TIMER == 5 && defined(CONFIG_S32K1XX_FTM5)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=5
#elif HRT_TIMER == 6 && defined(CONFIG_S32K1XX_FTM6)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=6
#elif HRT_TIMER == 7 && defined(CONFIG_S32K1XX_FTM7)
#  error must not set CONFIG_S32K1XX_FTM1=y and HRT_TIMER=7
#endif

/*
* HRT clock must be a multiple of 1MHz greater than 1MHz
*/
#if (HRT_TIMER_CLOCK % HRT_TIMER_FREQ) != 0
# error HRT_TIMER_CLOCK must be a multiple of 1MHz
#endif
#if HRT_TIMER_CLOCK <= HRT_TIMER_FREQ
# error HRT_TIMER_CLOCK must be greater than 1MHz
#endif

/**
* Minimum/maximum deadlines.
*
* These are suitable for use with a 16-bit timer/counter clocked
* at 1MHz.  The high-resolution timer need only guarantee that it
* not wrap more than once in the 50ms period for absolute time to
* be consistently maintained.
*
* The minimum deadline must be such that the time taken between
* reading a time and writing a deadline to the timer cannot
* result in missing the deadline.
*/
#define HRT_INTERVAL_MIN	50
#define HRT_INTERVAL_MAX	50000

/*
* Period of the free-running counter, in microseconds.
*/
#define HRT_COUNTER_PERIOD	65536

/*
* Scaling factor(s) for the free-running counter; convert an input
* in counts to a time in microseconds.
*/
#define HRT_COUNTER_SCALE(_c)	(_c)

/* Register accessors */

#define _REG(_addr)	(*(volatile uint32_t *)(_addr))

/* Timer register accessors */

#define REG(_reg)	_REG(HRT_TIMER_BASE + (_reg))

#define rSC         REG(S32K1XX_FTM_SC_OFFSET)
#define rCNT        REG(S32K1XX_FTM_CNT_OFFSET)
#define rMOD        REG(S32K1XX_FTM_MOD_OFFSET)
#define rC0SC       REG(S32K1XX_FTM_C0SC_OFFSET)
#define rC0V        REG(S32K1XX_FTM_C0V_OFFSET)
#define rC1SC       REG(S32K1XX_FTM_C1SC_OFFSET)
#define rC1V        REG(S32K1XX_FTM_C1V_OFFSET)
#define rC2SC       REG(S32K1XX_FTM_C2SC_OFFSET)
#define rC2V        REG(S32K1XX_FTM_C2V_OFFSET)
#define rC3SC       REG(S32K1XX_FTM_C3SC_OFFSET)
#define rC3V        REG(S32K1XX_FTM_C3V_OFFSET)
#define rC4SC       REG(S32K1XX_FTM_C4SC_OFFSET)
#define rC4V        REG(S32K1XX_FTM_C4V_OFFSET)
#define rC5SC       REG(S32K1XX_FTM_C5SC_OFFSET)
#define rC5V        REG(S32K1XX_FTM_C5V_OFFSET)
#define rC6SC       REG(S32K1XX_FTM_C6SC_OFFSET)
#define rC6V        REG(S32K1XX_FTM_C6V_OFFSET)
#define rC7SC       REG(S32K1XX_FTM_C7SC_OFFSET)
#define rC7V        REG(S32K1XX_FTM_C7V_OFFSET)
#define rSTATUS     REG(S32K1XX_FTM_STATUS_OFFSET)
#define rCOMBINE    REG(S32K1XX_FTM_COMBINE_OFFSET)
#define rPOL        REG(S32K1XX_FTM_POL_OFFSET)
#define rFILTER     REG(S32K1XX_FTM_FILTER_OFFSET)
#define rQDCTRL     REG(S32K1XX_FTM_QDCTRL_OFFSET)
#define rCONF       REG(S32K1XX_FTM_CONF_OFFSET)

